<template>
    <div class="terms-page">
      <a href="../templates/main.html">
        <img src="images/logo.png" alt="백만볼트 로고" class="logo" width="150" />
      </a>
      <div class="terms-container">
        <div class="terms-header">이용약관</div>
        <div class="terms-item" v-for="term in terms" :key="term.name">
          <label>{{ term.label }}<span>{{ term.required ? '[필수]' : '[선택]' }}</span></label>
          <div class="radio-group" v-if="term.name === 'term4'">
            <label>
              <img class="modal-image" src="images/modal-click.png" @click="openModal">
            </label>
          </div>
          <div class="radio-group" v-if="term.type === 'radio'">
            <label v-for="option in term.options" :key="option.value">
              <input type="radio" :name="term.name" :value="option.value" v-model="term.selected" @change="handleRadioChange"> {{ option.label }}
            </label>
          </div>

        </div>
  
        <div class="agree-all">
          <label>
            <input type="checkbox" id="agreeAll" v-model="agreeAll" @change="handleAgreeAll"> 모든 이용약관에 동의합니다.
          </label>
          <button class="next-button" id="nextButton" :disabled="!allAgreed" @click="nextClick" :class="{ enabled: allAgreed }">다음</button>
        </div>
  
       
      </div>
  
      <div id="modal" v-if="modalVisible" class="modal">
        <div class="modal-content">
          <span id="closeModal" @click="closeModal">&times;</span>
          <p id="modalText"><h2>이용약관</h2>
        <p> <span>제1장 총칙</span><br><br>

            <span>제1조 (목적)</span><br>
            본 약관은 환경부 공공충전인프라 멤버십 카드를 사용하는 소지자(이하 “회원”)이 한국자동차환경협회(이하 "협회")가 제공하는 서비스를 이용하는 것과 관련하여, 회원 및 협회의 권리·의무를 포함한 제반 사항을 규정하는데 그 목적이 있습니다.<br><br>


            <span>제2조 (정의)</span><br>
            본 약관에서 사용하는 주요 용어를 아래와 같이 정의합니다.<br>

            1. "서비스"라 함은 제7호의 “충전서비스”를 포함하여 무공해차 통합정보 누리집 홈페이지 (ev.or.kr, 이하 "홈페이지")를 통해 “회원”에게 제공하는 모든 서비스를 의미하며, 그 개요는 제3조에 기술된 바와 같습니다.<br>

            2. "회원"이라 함은 본 약관에 동의하고 서비스를 사용하는 자를 말합니다.<br>

            3. "아이디(ID)"(이하 "ID")라 함은 회원 식별 및 서비스 이용이 가능하도록 하기 위하여 “회원”이 선정하고 “협회”가 승인하는 문자 또는 숫자의 조합을 말합니다.<br>

            4. "비밀번호"라 함은 “ID”와 일치하는 회원임을 확인하기 위해 회원이 선정한 문자, 숫자, 특수문자의 조합을 말합니다.<br>

            5. “환경부 공공충전인프라 멤버십 카드”(이하 “회원카드”)라 함은 “회원”이 “협회”와 “서비스” 이용계약 체결 후 충전서비스 이용을 위해 지급되는 카드를 의미하며, 전자적 방식의 카드와 실물카드 모두를 포함합니다.<br>

            6. "충전소"라 함은 환경부 또는 환경부 장관이 관련 업무를 위탁한 자가 구축한 전기차 공공급속충전인프라를 의미합니다.<br>

            7. "충전서비스"라 함은 환경부가 구축한 전기차 충전인프라 이용을 “협회”에서 유료로 제공하는 서비스를 의미합니다.<br>

            8. “이용자”라 함은 “회원” 여부와 관계없이 “협회”가 제공하는 “충전서비스”를 이용하는 모든 사용자를 의미합니다.<br>

            9. "게시물"이라 함은 “회원”이 “서비스”를 이용함에 있어 "홈페이지" 상에 게시 또는 등록한 글, 사진, 그림, 음향, 동영상, 각종 파일 및 그 링크 등의 정보를 의미합니다.<br>

            10. “결제카드 유효성 검증”이라 함은 “회원”이 “충전서비스”를 이용할 시 “회원”이 “회원카드”에 등록한 결제수단의 결제가능여부를 판별하기 위해 실제 결제를 일으킨 뒤 즉시 취소하는 행위를 의미합니다.<br><br>


            <span>제3조 (서비스 개요)</span><br>
            ① 협회가 본 약관에 정해진 바에 따라 회원에게 제공하는 서비스는 아래와 같으며, 서비스를 이용하고자 하는 사용자는 본 약관에 정해진 제반 절차를 거쳐 회원으로 가입하여야 합니다.<br>

            1. 회원카드 발급신청 및 등록<br>

            2. 회원이 충전소에서 이용한 내역 조회<br>

            3. 충전서비스 및 요금 결제 등 충전서비스에 부수하는 사항<br>

            4. 충전소 운영관리 업무 및 기타 협회가 추가 개발하거나 본 약관 제17조에 따른 충전인프라 공동사용 서비스 등 다른 회사와 제휴 등을 통해 회원에게 제공하는 일체의 서비스<br>

            ② 제1항에서 정하는 서비스는 제휴사와의 제휴내용 변경, 협회의 영업방침의 변경 또는 기타 사정 등에 의하여 그 내용이 변경될 수 있으며, 이러한 변경내용이 있을 경우에 협회는 제4조 제2항 각호에 규정된 방법 중 한 가지 이상의 방법으로 안내하여 드립니다. 다만, 홈페이지를 통한 안내는 필수적으로 이루어집니다.<br>

            ③ 서비스는 제6조에 의하여 협회가 서비스 이용을 승인한 시점부터 이용할 수 있으며, 일부 서비스는 별도로 지정된 일자부터 이용할 수 있습니다. 단, 협회의 업무상 또는 기술상 장애로 인하여 서비스를 개시하지 못하는 경우에는 홈페이지에 공지하거나 회원에게 개별적으로 이를 통지합니다.<br><br>


            <span>제4조 (약관의 효력과 변경)</span><br>
            ① 협회는 사용자가 본 약관 내용에 동의하는 경우, 협회의 서비스 제공 행위 및 사용자의 서비스 사용 행위에 본 약관이 우선적으로 적용되며, 본 약관의 효력은 회원 탈퇴시까지 적용됩니다.<br>

            ② 본 약관은 필요시 협회의 자유 재량에 따라 개정될 수 있습니다. 협회가 본 약관을 개정하고자 할 경우 협회는 개정된 약관을 적용하고자 하는 날(이하 "효력발생일")로부터 14일 이전에 약관이 개정된다는 사실 및 개정된 내용 등을 다음 각 호에 규정된 방법 중 한 가지 이상의 방법으로 회원에게 고지하여 드립니다. 다만, 회원에게 불리하거나 중대한 내용의 변경일 경우에는 효력발생일 30일 전에 사전고지하여 드립니다.<br>

            1. 홈페이지 공지사항 화면에 게시(이후 최소 30일 유지)<br>

            2. E-mail<br>

            3. 전자쪽지<br>

            4. 서면<br>

            5. 일간지 공고 등의 방법<br>

            ③ 협회가 E-mail 또는 서면의 방법으로 본 약관이 개정된 사실 및 개정된 내용을 회원에게 고지하는 경우 협회는 회원이 협회에 기제공한 E-mail 주소나 주소지 중 가장 최근에 제공한 곳으로 통보합니다.<br>

            ④ 협회가 회원에 대하여 제1항의 규정에 따라 개정된 약관(이하 "개정약관")을 고지하고, 회원의 의사표시가 없을 시 동의한 것으로 본다는 뜻을 명확하게 고지한 경우, 개정약관 시행일까지 거부의사를 표명하지 않은 회원은 개정약관에 동의한 것으로 봅니다.<br>

            ⑤ 개정약관은 원칙적으로 그 효력발생일로부터 장래를 향하여 유효합니다.<br>

            ⑥ 본 약관의 개정과 관련하여 이의가 있는 회원은 제2장 제6조에 의거하여 체결된 이용계약을 해지할 수 있습니다. 단, 이의가 있음에도 불구하고 제1항 및 제2항에 정해진 바에 따른 협회의 고지가 있은 후 효력발생일 이후에 이용계약을 해지하는 회원의 경우에는 효력발생일로부터 이용계약 해지일까지의 기간 동안에는 개정약관을 적용합니다.<br>

            ⑦ 본 조의 통지방법 및 통지의 효력은 본 약관의 각 조항에서 규정하는 개별적인 또는 전체적인 통지에 대해서도 동일하게 적용합니다.<br><br>


            <span>제5조 (약관 외 준칙)</span><br>
            이 약관에 명시되지 아니한 사항은 관계법령 및 서비스별 안내 내용이 적용됩니다.<br>



            제2장 이용계약 체결 및 해지<br>

            제6조 (이용계약의 체결)<br>
            ① 이용계약은 서비스를 이용하고자 하는 사용자가 본 약관 및 본 약관과 별도로 안내되는 ‘개인정보 수집항목, 목적 및 이용안내 동의서’, ‘개인정보 위탁 동의서’에 대하여 동의를 한 후, 환경부가 정한 회원가입 신청양식에 정해진 사항을 기입하여 가입신청을 하고, 협회가 이러한 신청에 대하여 승낙함으로써 성립합니다.<br>

            ② 협회는 다음 각 호에 해당하는 회원가입 신청에 대해서는 승낙을 하지 않을 수 있으며, 협회가 회원가입 신청에 대해 승낙한 이후에 다음 각 호의 사유가 있음을 알게 된 때에는 언제든지 이용계약을 해지할 수 있습니다.<br>

            1. 홈페이지 가입 시 회원정보를 허위로 기재하였을 경우<br>

            2. 사회의 안녕 질서 혹은 미풍양속을 저해할 목적으로 서비스를 이용할 경우<br>

            3. 다른 사람의 서비스 이용을 방해하거나 다른 사람의 정보를 도용한 경우<br>

            4. 서비스 이용과 관련하여 법령과 본 약관이 금지하는 행위를 하는 경우<br>

            5. 영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우<br>

            6. 기타 회원으로 등록하는 것이 협회의 업무에 상당한 지장을 초래하는 경우 등 협회가 정한 서비스 사용 요건에 충족되지 않는 경우<br>

            7. 회원에 가입하고자 하는 사용자가 협회가 제공하는 서비스의 약관에 의해 회원자격을 상실한 적이 있는 경우 (단, 회원자격을 상실한 후 1년이 경과한 사용자로서 협회가 재가입을 승낙하는 경우는 예외로 합니다.)<br>

            8. 제7조 제2항에 기재된 사항에 해당되는 경우<br><br>


            <span>제7조 (이용계약 해지 및 회원 자격상실·정지)</span><br>
            ① 회원은 언제든지 서면, E-mail, 전화, 기타 협회가 정하는 방법으로 이용계약 해지를 요청할 수 있으며, 협회는 회원의 요청에 따라 조속히 이용계약 해지에 필요한 제반 절차를 수행합니다.<br>

            ② 회원이 다음 각 호의 사유에 해당하는 경우, 협회는 당해 회원에 대한 통보로서 회원의 자격을 상실 또는 정지시킬 수 있습니다. 단, 제 3호의 경우에는 별도의 통보 없이 당연히 자격이 상실됩니다.<br>

            1. 타인의 명의를 이용 또는 도용한 경우<br>

            2. 이용계약 신청 시에 허위의 내용을 기재한 경우<br>

            3. 회원이 사망한 경우<br>

            4. 서비스 이용과 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우<br>

            5. 다른 회원의 정당한 서비스 이용이나 권리를 방해하거나 침해하는 경우<br>

            6. 서비스를 이용하여 현행 법령이나 본 약관이 금지하거나 선량한 풍속에 반하는 행위를 하는 경우<br>

            7. 기타 본 약관에 규정된 회원의 의무를 위반한 경우<br>

            ③ 제2항이 정하는 사유로 자격이 상실 또는 정지된 회원은 해당 사유가 자신의 고의 또는 과실에 의한 것이 아님을 소명할 수 있습니다. 이 경우 협회는 회원의 소명 내용을 심사하여 회원의 주장이 타당하다고 판단하는 경우 상실, 정지된 회원의 자격을 조속히 복원하도록 합니다.<br>

            ④ 제1항에 의한 이용계약 해지 또는 제3항에 의한 회원자격 상실이 확정되는 시점은 이용계약 해지 요청일 또는 협회가 통보하는 회원자격 상실 예정일에 이용계약 해지 또는 회원자격 상실이 확정되며, 제2항 제3호의 경우에는 회원 사망일에 자격상실이 확정됩니다.<br><br>



            <span>제3장 의무 및 책임</span><br><br>

            <span>제8조 (회원의 의무)</span><br>
            ① 서비스를 이용하고자 하는 회원은 협회가 정하는 바에 따라 ID 및 비밀번호를 등록 후 회원카드를 발급받은 상태여야 합니다. 또한 이용자는 자신의 회원카드 및 카드번호를 타인에게 양도 및 대여할 수 없습니다.<br>

            1. ID와 비밀번호에 관한 관리책임은 회원 본인에게 있으므로, 회원은 자신의 ID 및 비밀번호를 제3자에게 알려주거나 이용하게 해서는 안 됩니다. 협회의 귀책사유 없이 회원이 자신의 ID 및 비밀번호를 도용당하여 입은손해에 대해서는 협회는 아무런 법적 책임을 부담하지 않습니다.<br>

            2. 협회는 회원이 선정한 ID가 불필요한 개인정보 기입으로 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 협회 및 그 유관회사의 운영자로 오인될 우려가 있는 경우에는 그러한 ID의 사용을 금지할 수 있습니다.<br>

            3. 회원이 자신의 ID 또는 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 즉시 협회에 통보하고 협회의 안내가 있는 경우에는 그에 따라야 합니다.<br>

            4. 제3호의 경우에 해당 회원이 협회에 그 사실을 통지하지 않거나, 통지한 경우에도 협회의 안내에 따르지 않아 발생한 불이익에 대하여 협회는 어떠한 책임도 지지 않습니다.<br>

            ② 회원은 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는 안됩니다.<br>

            1. 회원가입 신청 또는 회원정보 변경 시 허위내용을 기재하거나 다른 회원의 ID와 비밀번호를 도용하여 부정 사용하는 행위<br>

            2. 서비스 이용 관련 제반 신청행위 또는 변경행위 시 허위내용 기재행위<br>

            3. 홈페이지에 게시된 각종 정보의 무단 변경, 삭제 등 훼손 행위<br>

            4. 협회가 허용한 정보 이외의 다른 정보(컴퓨터 프로그램 및 광고 등)를 송신하거나 게시하는 행위<br>

            5. 홈페이지를 통하여 전송된 내용의 출처를 위장하는 행위<br>

            6. 법률, 계약에 의해 이용할 수 없는 내용을 게시, 게재, E-mail 또는 기타의 방법으로 전송하는 행위<br>

            7. 협회 및 제3자의 저작권 등 지적재산권에 대한 침해 행위<br>

            8. 협회 및 제3자의 명예를 손상, 모욕하거나 업무를 방해하는 행위<br>

            9. 범죄 행위를 목적으로 하거나 기타 범죄행위와 관련된 행위<br>

            10. 음란 정보, 폭력적인 정보 또는 기타 공서양속 및 사회질서를 해하는 행위<br>

            11. 협회의 승인을 받지 아니한 광고, 판촉물, 스팸메일, 행운의 편지, 피라미드 조직 기타 다른 형태의 권유를 게시, 게재, E-mail 또는 기타의 방법으로 전송하는 행위<br>

            12. 타인의 의사에 반하여 광고성 정보 등 일정한 내용을 지속적으로 전송하는 행위<br>

            13. 환경부의 사전 승낙 및 협회의 동의 없이 영리를 목적으로 서비스를 사용하는 행위<br>

            14. 본 약관을 포함한 기타 제반 규정 및 관계 법령, 이용조건을 위반하는 행위<br>

            15. 기타 서비스 이용의 안정적인 운영에 지장을 주거나 줄 우려가 있는 일체의 행위<br>

            ③ 회원은 회원자격 및 서비스 이용과 관련된 이용 지위, 권한을 타인에게 양도하거나 대여 또는 담보의 목적으로 이용할 수 없으며, 이를 양도, 대여, 담보의 목적으로 이용할 경우 발생하는 책임과 불이익은 회원에게 있습니다.<br>

            ④ 회원이 홈페이지 내에 게시하는 게시물과 관련하여서는 회원 스스로 관계 법령을 준수하여야 하고 이를 위반하여 발생하는 모든 책임은 회원 자신에게 있습니다. 또한 홈페이지에 회원이 게시한 모든 게시물과 자료의 보관·관리 및 운영의 책임은 회원이 부담하며, 협회는 이를 별도 보관하거나 백업을 지원할 의무를 부담하지 않습니다.<br>

            ⑤ 회원은 서비스를 이용함으로써 얻은 정보를 협회의 사전 동의 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.<br>

            ⑥ 회원이 홈페이지에 게시한 댓글 등의 게시물이 다음에 규정하는 부적격 자료에 해당하여 수정·삭제하는 등의 적정한 조치를 취하도록 협회의 요구나 지침이 있는 경우, 회원은 즉시 해당 게시물을 수정·삭제하는 등의 적정한 조치를 취하여야 하며, 기한 내에 적정한 조치를 취하지 않는 경우 협회가 임의로 수정·삭제 등의 적정한 조치를 하는데 동의한 것으로 봅니다. 다만, 제3자 모욕 또는 음란정보 등 사회질서를 해하는 행위에 대해서는 협회가 즉시 수정·삭제 등의 조치를 취할 수 있으며, 이에 대하여 게시자는 협회에 이의를 제기할 수 있습니다.<br>

            1. 저작권 침해자료<br>

            가. 협회의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 자료<br>

            나. 저작권자가 배포를 원하지 않는 자료<br>

            2. 음란자료<br>

            가. 사회상규 및 일반 통념상 성적 수치심을 일으킬 수 있는 표현이 포함된 자료<br>

            나. 기타 관련 법령이 허용하는 수준을 넘는 성적 표현이 포함된 자료<br>

            3. 폭력물 및 명예훼손에 관한 자료<br>

            가. 과도하게 폭력적인 내용을 가지고 있는 자료<br>

            나. 다른 회원, 제3자 또는 협회를 비방하거나 명예를 손상시키거나 또는 불이익을 끼치는 것으로 판단되는 자료<br>

            4. 기타 부적격 자료<br>

            가. 공공질서 및 공서양속에 위반되는 내용을 유포하는 경우<br>
            나. 범죄적 행위에 결부된다고 인정되는 내용인 경우<br>
            다. 첨예한 정치적·종교적 분쟁을 야기할 수 있는 경우<br>
            라. 불필요하거나 승인되지 않은 광고·판촉물을 게재하는 경우<br>
            마. 타인의 개인정보를 도용하여 작성한 내용이거나, 타인이 입력한 정보를 무단으로 위·변조한 내용인 경우<br>
            바. 동일한 내용을 중복하여 다수 게시하는 등 게시의 목적에 어긋나는 경우<br>
            사. 전기통신사업법 등 관계 법령, “협회”의 약관 및 이용지침 등에 위반된다고 판단되는 경우<br>

            ⑦ 회원은 관련 법령, 본 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, 기타 협회가 통지하는 사항을 준수하여야 합니다.<br><br>

                <span>제9조 (기재사항의 변경)</span><br>
            ① 회원은 이용계약과 관련하여 기재한 사항이 변경되었을 경우 협회의 별도 안내가 없더라도 지체 없이 수정하여야 합니다.<br>

            ② 제1항의 미준수로 인하여 발생하는 모든 손실은 회원에게 책임이 있습니다.<br><br>

                <span>제10조 (회원의 책임)</span><br>
            ① 회원은 서비스 이용 중 고의 또는 과실로 인해 발생한 협회의 모든 재산상의 손실이나 제 3자에게 끼친 인적·물적 손실에 대하여 배상할 책임이 있습니다.<br>

            ② 회원은 충전 완료 후 다른 이용자를 위해 즉시 차량을 이동하여야 할 의무가 있습니다.<br>



                <span>제4장 서비스의 이용</span><br><br>

            <span>제11조 (서비스의 이용 개시)</span><br>
            ① 회원의 회원가입 신청 이후 협회의 승인이 완료된 시점부터 서비스를 개시합니다. 단, 일부 서비스는 별도로 지정된 일자부터 서비스를 개시할 수 있습니다.<br>

            ② 협회의 업무상 또는 기술상 장애로 인하여 서비스를 개시하지 못하는 경우에는 홈페이지에 공지하거나 회원에게 이를 통지합니다.<br><br>


            <span>제12조 (서비스의 제공)</span><br>
            ① 이용자는 협회에서 제공하는 다음 각 호에 대한 서비스를 이용할 수 있습니다.<br>

            1. 2016년 4월 11일 이후로 시행하는 유료 충전서비스<br>

            2. 헬프데스크를 통한 상담 서비스<br>

            3. 회원카드 발급 후 본 약관 제17조에 따른 충전인프라 공동사용 서비스<br>

            ② 서비스의 제공은 연중무휴 1일 24시간 유지함을 원칙으로 하되, 충전서비스의 경우 충전소 설치 장소의 영업시간에 제한이 있는 곳은 영업시간에만 이용이 가능합니다. 또한, 주차비 등 설치 장소의 유료정책에 따라 청구되는 비용에 대해서 협회는 책임지지 않습니다.<br>

            ③ 협회가 제공하는 충전서비스는 충전 단가 변경, 부품 고장, 통신·전력망 장애(3G 서비스 종료, 정전, 휴전, 단전 등), 카드사 및 결제중계사(PG사)의 자체 점검 및 서비스 종료 등의 사유로 인하여 일시적으로 운영중지 될 수 있습니다. 이러한 경우 협회는 E-mail이나 홈페이지에 게시하는 방법으로 회원에게 알려드리며, 사전에 알려드릴 수 없는 부득이한 사유가 있을 시에는 사후에 알려드릴 수 있습니다.<br>

            ④ 충전소의 최초 구축 후 한국전력공사의 수전 및 전기안전공사의 다중이용시설 점검 미완료 등의 사유로 인해 충전서비스가 일정기간 동안 이용 불가능할 수 있습니다.<br>

            ⑤ 홈페이지가 협회가 운영하지 않는 다른 웹사이트가 링크의 방식 등으로 연결된 경우, 협회는 회원과 당해 웹사이트 간 발생하는 거래 등 일체의 행위에 대해서 어떠한 책임도 지지 않습니다.<br><br>


            <span>제13조 (회원카드의 이용 및 관리)</span><br>
            ① 이용계약 체결 후 회원카드 발급을 신청한 경우 회원은 회원카드 발급을 위해 요구하는 수집정보를 협회에 제공해야 하며, 협회는 회원에게 회원카드를 우편 등으로 제공합니다. 단, 전자적 방식의 카드 형태로 회원카드 발급이 진행되는 경우, 실물카드 발급은 제한되며 협회는 이를 홈페이지에 게시하여 안내합니다.<br>

            ② 회원은 차량 1대당 하나의 회원카드 발급을 원칙으로 하며, 차량번호를 등록 후 회원카드를 사용해야 합니다.<br>

            ③ 회원이 충전서비스를 이용하고자 할 경우에는 회원카드를 충전기에 접촉하여야 하며, 회원이 아닌 경우 신용카드(구형 충전기의 경우 후불교통 기능 필수)를 충전기에 접촉하여 충전서비스를 이용할 수 있습니다.<br>

            ④ 회원카드를 발급한 회원은 유효한 결제카드(국내 모든 신용 또는 체크카드 단, 축협, 유류카드, 하이패스 제외)를 등록하여 사용하여야 합니다.<br>

            ⑤ 회원카드 및 회원카드 번호는 회원 스스로의 책임 하에 관리하여야 하며 회원의 고의 또는 과실로 회원카드가 훼손, 분실, 도난 되는 등의 사고가 발생할 경우 당해 회원은 그 사실을 즉시 협회에 통지하여야 합니다.<br>

            ⑥ 협회는 회원으로부터 제4항에 따른 통지를 받은 경우 즉시 사고 등록 및 당해 회원의 회원카드의 사용을 중지하는 등 필요한 제반 조치를 취해야 합니다. 단, 협회는 제4항에 따른 회원의 통지가 있기 전에 회원에게 발생한 손해에 대하여 어떠한 책임도 지지 않습니다.<br>


            <span>제14조 (이용방법 및 주의사항)</span>
            ① 회원카드에 결제카드 미연결 및 시스템 오류 등으로 회원카드로 사용한 충전요금이 징수되지 않은 경우에는 회원카드 발급자에게 요금이 소급 청구될 수 있습니다.<br>

            ② 협회는 미납요금 방지를 위해 결제카드 유효성 검증을 할 수 있으며, 미납된 충전요금에 대해서는 이용자 동의 없이 요금을 청구할 수 있고 요금 정산이 이루어지지 않을 경우 충전서비스 이용을 제한할 수 있으며, 미납요금 회수를 위해 결제대행업체 등에 회원의 개인정보를 제공할 수 있습니다.<br>

            ③ 이용자는 충전서비스를 이용함에 있어 해당 충전소에 게시된 이용수칙을 따라야 하며 협회 담당자의 안내가 있을 경우 이에 따라야 합니다.<br>

            ④ 이용자는 충전이 완료될 때까지 충전기가 설치된 지점에서 대기해야 하며 이용자의 부재로 인한 차량 도난 등 피해에 대해서는 협회에서 책임을 지지 않습니다. 또한 이용자는 차량 충전 완료 후 신속히 차량을 이동시켜야 합니다.<br>

            ⑤ 협회는 시설안전 및 화재 예방 등을 위해 CCTV, Web Cam등을 설치·운영할 수 있으며 이용자의 고의, 과실로 인한 충전기 파손 시의 책임은 이용자에게 있습니다.<br>

            ⑥ 협회는 서비스 이용과 관련하여 이용자에게 발생한 손해에 대하여 협회의 고의 또는 중대한 과실로 인해 발생한 손해를 제외하고 이에 대하여 책임을 부담하지 않습니다.<br>

            ⑦ 이용자는 전기자동차 배터리의 특성을 충분히 이해한 후 충전서비스를 이용하여야 합니다. 배터리 잔량, 충전기 설치 환경 및 주변 온도, 충전기의 출력 등 조건 및 사양에 따라 배터리의 충전 속도 및 충전량이 다를 수 있으며, 협회에게 고의 또는 중대한 과실이 있는 경우가 아닌 이상 협회는 충전서비스의 이용이 차량 성능에 영향을 미치더라도 이에 대해 책임을 부담하지 않습니다.<br>

            ⑧ 이용자가 충전서비스 이용 시 충전기 외부환경 및 설치조건, 차량의 배터리 상태에 따라 충전기 LCD에 표시되는 충전량과 차량에 표시되는 충전량이 일부 상이할 수 있으며, 협회는 충전기 LCD에 표출되는 충전량에 따라 충전요금을 부과합니다.<br>

            ⑨ 이용자는 협회에서 배포하는 전기자동차 충전인프라 이용 안내문의 이용방법에 따라 충전서비스를 이용하여야 하며, 협회는 이용자의 부주의로 발생하는 인적, 물리적 손해에 대하여는 책임을 부담하지 않습니다.<br>

            ⑩ 이용자가 협회에서 배포하는 전기자동차 충전인프라 이용 안내문의 이용 방법을 따르지 않거나 그 외의 방법으로 충전서비스를 이용할 경우, 협회는 충전기 파손 등 충전소에 발생하는 피해에 대하여 이용자에게 손해배상을 요구할 수 있습니다.<br><br>

            [붙임] 전기자동차 충전인프라 이용 안내문<br><br>


            <span>제15조 (충전 사용 기록)</span><br>
            ① 회원이 충전소에서 사용한 충전량, 충전 금액 등의 정보 기록은 자동으로 충전기에서 한국환경공단 및 협회의 서버로 전송됩니다.<br>

            ② 충전기의 충전량 및 통계데이터 등의 사용 현황 데이터는 충전기 제조사, 충전기 운영사업자, 결제중계사 등 사업자 자산관리 및 보호, 충전기 정상 운영 확인, 충전량에 따른 과금, 서비스 운영 개선 등의 목적을 위해 활용될 수 있습니다.<br><br>


            <span> 제16조 (서비스 이용 및 결제)</span><br>
            ① 회원은 환경부에서 고지하는 충전요금으로 충전서비스를 이용할 수 있으며, 충전요금은 시장 상황 등에 따라 변경될 수 있습니다. 요금 변경의 구체적 내용은 홈페이지 또는 개별 충전기의 요금 화면에 게재합니다.<br>

            ② 회원의 신용카드 또는 다른 유형의 결제카드가 개인 신용등급 및 연체 등의 문제로 인해 결제가 거절되어 충전서비스 이용에 대한 비용이 정산되지 않을 경우에 협회는 회원에게 정산을 요구할 수 있고, 그 정산이 모두 완료될 때까지 서비스 이용을 중지할 수 있으며, 지속적인 문제가 발생할 경우 회원자격을 박탈할 수 있습니다.<br>

            ③ 회원은 다음 각 호에 따라 전자결제(신용카드 빌링 서비스) 방법 또는 결제 중계사가 인정하는 방법으로 충전요금을 결제하여야 합니다.<br>

            1. 회원은 협회가 정한 방법(신용카드, 기타 협회가 정하는 결제 수단)으로 충전요금을 결제중계사에 납부합니다.<br>

            2. 회원은 본인인증방식 등 협회에서 정한 방법을 거쳐 결제카드를 등록해야 합니다.<br>

            ④ 협회는 개인정보보호법 등 관련 법령에 따른 회원의 동의를 받아 회원의 결제 정보를 검색할 수 있으며, 회원의 제반 정보가 잘못된 경우에는 개인정보보호법 등 관련 법령에 따른 회원의 동의를 받아 이를 정정할 수 있습니다.<br>

            ⑤ 충전요금을 지정한 기일까지 납입하지 아니한 경우 협회는 그 요금에 대해 채권추심 등의 절차를 거쳐 요금 납부를 요청할 수 있습니다.<br>

            ⑥ 회원은 청구된 요금 등에 대하여 이의가 있는 경우 이의 신청을 할 수 있습니다.<br>

            1. 협회는 이의신청 접수 후 영업일 기준 10일 이내에 이의 타당성 여부를 조사하고 그 결과를 회원 또는 그 대리인에게 통지합니다.<br>

            2. 부득이한 사유로 인하여 제1항에서 정한 기간 내에 이의신청 결과를 통지할 수 없는 경우에는 그 사유 및 재지정된 처리기한을 명시하여 이를 회원 또는 그 대리인에게 통지합니다.<br>

            ⑦ 협회는 요금 등의 과납 또는 오납이 있을 때에는 그 과납 또는 오납된 요금을 반환합니다. 이 경우 회원을 포함한 이용자는 정확한 충전이력 확인을 위해 카드번호 등 결제 정보를 확인할 수 있는 사항을 협회에 제공하여야 합니다.<br>

            ⑧ 협회는 요금 등을 반환하여야 할 회원에게 미납요금 등이 있을 경우에는 반환하여야 할 요금 등에서 우선 변제하고 반환할 수 있습니다.<br>

            ⑨ 회원이 회원카드를 통해 충전서비스를 이용하는 경우, 다음 각 호에 동의한 것으로 간주합니다.<br>

            1. 간편결제를 등록한 회원은 충전서비스 이용요금에 대해 별도의 인증과정 없이 결제를 하겠다는 의사표시를 한 것으로 봅니다.<br>

            2. 협회는 간편결제 시 카드 결제 가능 여부를 체크하기 위하여 일정 요금을 카드사에 승인 및 취소 요청할 수 있습니다.<br>

            3. 간편결제 시점에 회원의 신용카드 등의 유효성, 한도 등의 문제로 결제실패가 발생한 경우에 미수로 처리되며, 해당 미수 금액이 정상적으로 결제되기 전까지는 해당 회원의 회원카드 발급 및 요금 결제 이용이 제한됩니다.<br>

            4. 제3호에 따라 미수가 발생한 경우, 협회는 협회가 정한 정책에 따라 회원에 대한 별도 고지 없이 회원이 등록한 결제수단으로 재결제 시도를 진행할 수 있습니다.<br>

            5. 결제 시점에 시스템 장애로 인하여 결제 실패가 된 경우에는, 시스템 정상화가 된 시점에 회원에 대한 별도 고지 없이 다시 결제를 진행합니다.<br><br>


            <span>제17조 (충전인프라 공동사용 서비스)</span><br>
            ① 회원카드에 간편결제 등록 시 협회와 공동이용 체계 운영 협약을 체결한 민간충전사업자의 충전인프라를 사용할 수 있는 공동사용서비스에 자동으로 등록됩니다.<br>

            ② 민간충전사업자의 충전인프라 사용요금은 민간충전사업자가 정하며 그 금액은 운영방침 및 시장상황 등에 따라 수시로 변경될 수 있습니다.<br>

            ③ 충전인프라 공동사용에 따른 요금결제는 충전량 및 요금확인 기간 등에 따라 결제일까지 1개월 이상 소요될 수 있습니다.<br>

            ④ 충전요금의 과납 또는 오납이 있어 요금 등을 반환하여야 할 회원에게 충전사업자의 회계처리 문제 등으로 부득이하게 반환이 되지 않는 경우 익월 결제 요금에서 상계처리하여 반환할 수 있습니다.<br><br>


            <span>제18조 (충전기 고장이나 사고 발생 시 준수사항)</span><br>
            ① 이용자는 충전기 사용 시 반드시 협회의 충전기 사용 안내 가이드를 준수해야 하며, 충전기 사용 중 문제 발생 시 본인 및 다른 이용자의 안전을 위해 즉시 협회로 알려야 합니다.<br>

            ② 이용자는 충전기 사용시간 내에 발생하는 이용자의 모든 법률 위반으로 인한 벌금, 과태료 등의 불이익을 부담해야 할 의무가 있습니다.<br><br>



            <span>제5장 기타</span><br><br>

            <span>제19조 (회원에 대한 통지)</span><br>
            ① 협회가 회원에 대한 개별 통지를 하는 경우 본 약관에 별도의 규정이 없는 한, 회원이 등록한 정보를 기준으로 한 E-mail, 인스턴트 메시지, 문자메시지, 우편 등의 방법으로 통지할 수 있습니다.<br>

            ② 협회가 회원 전체에 대하여 통지를 하는 경우, 홈페이지 내 공지사항 게시판에 7일 이상 게시함으로써 제1항의 통지를 갈음할 수 있습니다.<br><br>


            <span>제20조 (서비스의 종료)</span><br>
            ① 서비스를 종료하고자 할 경우 협회는 서비스를 종료하고자 하는 날로부터 전체 서비스의 경우 30일 이전에, 일부 서비스의 경우 14일 이전에 제4조 제2항 각호에 규정된 통지방법을 통해 회원에게 알려드립니다.<br>

            ② 제1항에 따라 협회가 통지한 서비스 종료일 이후 회원은 협회로부터 서비스를 제공받지 못합니다.<br><br>


            <span>제21조 (서비스 이용 관련 분쟁해결)</span><br>
            ① 협회는 서비스 이용과 관련하여 회원으로부터 제출되는 불만사항 및 의견을 최대한 신속하게 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 회원에게 그 사유와 처리일정을 통보해 드립니다.<br>

            ② 서비스 이용과 관련하여 협회의 책임 있는 사유에 의하여 회원에게 피해가 발생한 경우 협회는 최대한 신속하게 보상업무를 진행합니다.<br><br>


            <span>제22조 (면책조항)</span><br>
            ① 협회는 기간통신 사업자 및 전기사업자, 카드사 및 결제중계사가 통신 및 서비스 공급을 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우 책임이 면제됩니다.<br>

            ② 협회는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 발생한 손해에 대한 책임이 면제됩니다.<br>

            ③ 협회는 이용자의 귀책사유로 인한 서비스 이용의 장애 또는 손해에 대하여 책임을 지지 않습니다.<br>

            ④ 협회는 충전기 고장 시 홈페이지에 게재하는 충전기 상태정보 표시 및 공지가 부득이한 사유로 늦어진 경우 발생한 손해에 대한 책임이 면제됩니다.<br>

            ⑤ 협회는 홈페이지에 표출된 어떠한 의견이나 정보에 대해 확신이나 대표할 의무가 없으며 이용자나 제3자에 의해 표출된 의견을 승인·반대하지 않습니다.<br>

            ⑥ 협회는 이용자가 서비스를 이용하며 타 이용자로 인해 입게 되는 정신적 피해에 대하여 보상할 책임을 지지 않습니다.<br>

            ⑦ 협회는 이용자 상호간 및 이용자와 제3자 상호 간에 서비스를 매개로 발생한 분쟁에 대해 개입할 의무가 없으며, 이로 인한 손해를 배상할 책임도 없습니다.<br><br>


            <span>제23조 (개인정보의 보호)</span><br>
            ① 회원들의 개인정보는 서비스의 원활한 제공을 위하여 회원들이 동의한 목적과 범위 내에서만 이용됩니다. 협회는 관련 법령을 준수하며, 회원들이 동의하지 아니하는 한 회원들의 개인정보를 제3자에게 제공하지 않습니다. 자세한 내용은 ‘개인정보처리방침’을 참고하여 주십시오.<br>

            ② 협회는 개인정보보호에 대한 상세한 내용을 '개인정보처리방침'에 명시하고 있으며, 회원이 상시 확인할 수 있도록 홈페이지를 통해 공지하고 있습니다.<br>

            ③ 개인정보보호의 내용은 추가, 변경될 수 있으며, 이 경우 추가 또는 변경사항을 본 계약 제4조 제2항 각호에 규정된 통지방법을 통해 회원에게 알려드립니다.<br><br>


            <span>제24조 (게시물의 저작권 등)</span><br>
            ① 회원의 게시물에 대한 저작권은 저작권법에 의한 보호를 받습니다. 협회가 작성한 저작물에 대한 저작권 및 기타 지적재산권은 협회에 귀속됩니다.<br>

            ② 협회는 원활한 서비스의 제공을 위해 필요한 경우 게시물에 관련된 세부 이용지침을 별도로 정하여 시행할 수 있으며, 홈페이지에 등록된 게시물 등을 모니터링할 수 있습니다.<br>


            ③ 회원은 자신이 게시한 게시물을 협회가 국내외에서 다음 각 호의 목적으로 사용하는 것에 동의합니다.<br>

            1. 홈페이지 내에서 회원 게시물의 복제, 전송, 전시, 배포 및 우수 게시물을 메인 화면에 노출하기 위하여 회원 게시물의 크기를 변화하거나 단순화하는 등의 방식으로 수정<br>

            2. 협회가 운영하는 관련 사이트의 서비스 내에서 회원 게시물을 전시·배포. 단, 회원이 전시·배포에 대하여 명백히 반대의 의사를 표명하는 경우에는 예외로 합니다.<br>

            3. 협회를 홍보하기 위한 목적으로 해당 회원의 동의를 득하여 미디어, 통신사 등에게 회원의 게시물 내용을 보도·방영<br>

            ④ 협회가 회원의 게시물을 전항 각 호에 기재된 목적 이외에 상업적 목적으로 사용하고자 하는 경우에는 사전에 해당 회원으로부터 동의를 얻습니다.<br>

            ⑤ 회원이 이용계약을 해지하거나 본 약관에 의하여 회원자격을 상실한 경우에도 제3자에게 의하여 스크랩, 펌, 담기 등으로 다시 게시된 게시물, 제3자에 의하여 댓글이 첨부된 게시물 등 다른 회원의 정상적인 서비스 이용에 필요한 게시물은 삭제되지 않을 수 있습니다.<br>

            ⑥ 협회가 합병, 영업양도, 운영하는 사이트 간의 통합 등의 사유가 발생하는 경우, 필요한 범위 및 방법 내에서 게시물의 위치를 변경할 수 있습니다.<br><br>


            <span>제25조 (준거법 및 합의관할)</span><br>
            ① 본 약관에서 정하지 않은 사항과 본 약관의 해석에 관하여는 대한민국법 및 상관례에 따릅니다.<br>

            ② 서비스 및 본 약관과 관련한 제반 분쟁 및 소송은 협회 본사 소재지를 관할하는 법원을 관할법원으로 합니다.<br><br>


            <span>부칙</span><br>
            1. 본 약관은 2018.06.26. 부터 시행합니다.<br>

            2. 본 약관은 2023.04.01. 부터 개정 시행합니다.<br>

            3. 본 약관은 2024.01.08. 부터 개정 시행합니다.<br>

        </p>
        <button class="close-button" id="closeModal" @click="closeModal">닫기</button></p>
        </div>
      </div>
    </div>
  </template>

  <script>
  export default {
    data() {
      return {
        agreeAll: false,
        modalVisible: false,
        terms: [
          { name: "term1", label: "이용약관", required: true, type: "radio", options: [{ value: "agree", label: "동의" }] },
          { name: "term2", label: "개인정보 수집 및 이용에 관한 안내", required: true, type: "radio", options: [{ value: "agree", label: "동의" }] },
          { name: "term3", label: "개인정보 제3자 제공 및 취급 위탁", required: false, type: "radio", options: [{ value: "agree", label: "동의" }, { value: "disagree", label: "미동의" }] },
          { name: "term4", label: "공공금융충전인프라 서비스 공급 및 이용약관", required: true, type: "radio",  options: [{ value: "agree", label: "동의" }] },
          { name: "term5", label: "만 14세 이상 가입 가능", required: true, type: "radio", options: [{ value: "agree", label: "동의" }] }
        ]
      };
    },
    computed: {
      allAgreed() {
        return this.terms.every(term => term.selected === "agree" || !term.required);
      }
    },
    methods: {
      openModal() {
        this.modalVisible = true;
      },
      closeModal() {
        this.modalVisible = false;
      },
      handleAgreeAll() {
        this.terms.forEach(term => {
          term.selected = this.agreeAll ? "agree" : null;
        });
      },
      handleRadioChange() {
        this.agreeAll = this.terms.every(term => term.selected === "agree" || !term.required);
      },
      nextClick() {
        if (this.allAgreed) {
          this.$router.push("/signup");
        }
      }
    }
  };
  </script>
  
  <style scoped>
   .terms-page {
    font-family: Arial, sans-serif;
    margin: 0;
    padding: 0;
    background-color: #fff;
    display: flex;
    flex-direction: column;
    align-items: center;
    justify-content: center;
    min-height: 100vh;
}

.logo {
  top: 5px;
  left: 5px;
  width: 150px;
}

.terms-container {
  width: 600px;
  background: #fff;
  border: 1px solid #C9D6DE;
  padding: 30px 24px 28px 24px;
  border-radius: 10px;
  box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);
  margin-bottom: 100px;
}

.terms-header {
  font-size: 24px;
  font-weight: bold;
  margin-bottom: 20px;
  border-bottom: 3px solid #52616A;
  margin-top: 20px;
  padding-bottom: 30px;
}

.terms-item {
  display: flex;
  justify-content: space-between;
  align-items: center;
  margin: 15px 0;
  border-bottom: 1px solid #ccc;
  padding-bottom: 20px;
  margin-bottom: 30px;
}

.terms-item label {
  flex-grow: 1;
  font-size: 16px;
}

.terms-item label span {
  margin-left: 10px;
  color: #007BFF;
  font-size: 14px;
}

.radio-group {
  display: flex;
  gap: 10px;
}

.agree-all {
  font-size: 18px;
  margin: 20px 0;
  text-align: left;
}

.next-button {
  width: 100%;
  height: 65px;
  padding: 15px;
  font-size: 16px;
  color: white;
  background-color: #52616A;
  border: none;
  border-radius: 8px;
  cursor: not-allowed;
  margin-top: 15px;
}

.next-button.enabled {
  background-color: #1E2022;
  cursor: pointer;
}

.modal-image {
  width: 16px;
  height: 16px;
  margin-right: 10px;
}

.modal {
  display: flex; /* 기본값 수정 */
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background: rgba(0, 0, 0, 0.5);
  justify-content: center;
  align-items: center;
  z-index: 1000;
}

.modal-content {
  background-color: white;
  padding: 20px;
  border-radius: 8px;
  width: 80%;
  max-width: 800px;
  max-height: 70vh;
  overflow-y: auto;
}
  </style>
  